Revit 2027 API
TableView.GetCalculatedValueName Method
 Gets the calculated value name for a cell from the template view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetCalculatedValueName(
	SectionType sectionType,
	int row,
	int column
)
Public Function GetCalculatedValueName (
	sectionType As SectionType,
	row As Integer,
	column As Integer
) As String
public:
String^ GetCalculatedValueName(
	SectionType sectionType,
	int row,
	int column
)
member GetCalculatedValueName :
        sectionType : SectionType *
        row : int *
        column : int -> string
Parameters
sectionType SectionType
 The section type.
row Int32
 The row.
column Int32
 The column.
Return Value
String
 The name of the calculated value.
Exceptions
Exception | Condition
ArgumentException |  The sectionType is not a valid type for this view.
ArgumentOutOfRangeException |  The given row number row is invalid. -or- The given column number column is invalid. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace